{
    "displayName": "CA001-Block-Legacy-Authentication",
    "state": "enabledForReportingButNotEnforced",
    "conditions": {
        "users": {
            "includeUsers": ["All"],
            "excludeGroups": ["{{GroupId:CA-Exclusion-EmergencyAccess}}"]
        },
        "applications": {
            "includeApplications": ["All"]
        },
        "clientAppTypes": [
            "exchangeActiveSync",
            "other"
        ]
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": ["block"]
    }
}
